In [1]:
#this is a testing for how Github works
import pandas as pd
import numpy as np

In [2]:
print('Hello World')

Hello World

In [1]:
12+13

25

In [10]:
my_df = pd.DataFrame(index=[1,2,3], columns=['one','two','three'])

for x in [1,2,3]:
    for y in ['one','two','three']:
        my_df.loc[x][y] = f'{x}{y}'


my_df

    one   two   three
1  1one  1two  1three
2  2one  2two  2three
3  3one  3two  3three

In [8]:
my_df.loc[1]['three'] = 'sheesh'

my_df

    one  two   three
1  what  NaN  sheesh
2  what  NaN     NaN
3   NaN  NaN     NaN